namespace Practice2.Task23;

// Напишите программу для вычисления високосного года.
//   a. год, номер которого кратен 400, — високосный;
// остальные годы, номер которых кратен 100, — невисокосные
// остальные годы, номер которых кратен 4, — високосный;
// все остальные годы — невисокосные.


class Program
{
  static void Main(string[] args)
  {
    Console.WriteLine("Hello, World!");
  }
}